In [0]:
# series data structure

In [0]:
import pandas as pd

In [0]:
animals=['Tiger','Bear','Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [0]:
numbers=[1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [0]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [0]:
A=pd.Series([1,2,3],index=[0,1,2])
B=pd.Series([4,5,6],index=[1,2,3])
A+B

0    NaN
1    6.0
2    8.0
3    NaN
dtype: float64

If using NaN values is not the desired behavior, we can modify the fill value using appropriate object methods in place of the operators. For example, calling A.add(B) is equivalent to calling A + B, but allows optional explicit specification of the fill value for any elements in A or B that might be missing:

In [0]:
A.add(B,fill_value=0)

0    1.0
1    6.0
2    8.0
3    6.0
dtype: float64

In [0]:
import numpy as np

In [0]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [0]:
A=pd.DataFrame(rng.randint(0,20,(2,2)),columns=list('AB'))
A

    A   B
0   6  18
1  10  10

In [0]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),                         
                 columns=list('BAC'))

In [0]:
A+B

      A     B   C
0   8.0  27.0 NaN
1  18.0  13.0 NaN
2   NaN   NaN NaN

In [0]:
A.add(B,fill_value=0)

      A     B    C
0   8.0  27.0  6.0
1  18.0  13.0  2.0
2   2.0   4.0  6.0

In [0]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [0]:
s.iloc[3]

'South Korea'

In [0]:
s.loc['Golf']

'Scotland'

In [0]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [0]:
total=0
for item in s:
  total+=item
print(total)

324.0

In [0]:
s=pd.Series(np.random.randint(0,1000,10000))
s.head()

0     11
1    237
2    463
3    164
4    705
dtype: int64

In [0]:
A=rng.randint(10,size=(3,4))
A

array([[9, 3, 5, 1],
       [9, 1, 9, 3],
       [7, 6, 8, 7]])

In [0]:
df.iloc[1:2]

   Q  R  S  T
1  9  1  9  3

In [0]:
# A-A[0]

# row-wise deletion

array([[ 0,  0,  0,  0],
       [-1,  0, -5,  8],
       [ 4,  1, -2,  0]])

In [0]:
df = pd.DataFrame(A, columns=list('QRST'))        
df - df.iloc[0]

#

   Q  R  S  T
0  0  0  0  0
1  0 -2  4  2
2 -2  3  3  6

In [0]:
df.subtract(df['R'],axis=0)

   Q  R  S  T
0  6  0  2 -2
1  8  0  8  2
2  1  0  2  1

HANDLING MISSING DATA

In [0]:
for dtype in['object','int']:
  print(dtype)
  %timeit np.arange(1E6,dtype=dtype).sum()
  print()

object
10 loops, best of 3: 69.7 ms per loop

int
100 loops, best of 3: 2.5 ms per loop

NAN:MISSING NUMERICAL DATA

In [0]:
vals2 = np.array([1, np.nan, 3, 4])       
vals2.dtype

dtype('float64')

In [0]:
1+np.nan

nan

In [0]:
0*np.nan

nan

In [0]:
vals2.sum()
vals2.min()
vals2.max()

nan

NaN and None in Pandas

 For example, if we set a value in an integer array to np.nan, it will automatically be upcast to a floating-point type to accommodate the NA

In [0]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [0]:
 x = pd.Series(range(2), dtype=int)        
 x

0    0
1    1
dtype: int64

In [0]:
x[0]=None
x

0    NaN
1    1.0
dtype: float64